In [1]:
import pandas as pd

In [2]:
df_exams = pd.read_csv('StudentsPerformance.csv')
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

## 1 Selecting one column

### 1.1 Syntax

In [4]:
#select a columns with [] (preferred way to select a column)
df_exams['gender'] #displays the gender column

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object

In [6]:
#check the datatype of the column
type(df_exams['gender'])

pandas.core.series.Series

In [8]:
#series: attributes and methods
df_exams['gender'].index

RangeIndex(start=0, stop=1000, step=1)

In [9]:
#get the first 5 rows of the series
df_exams['gender'].head()

0    female
1    female
2    female
3      male
4      male
Name: gender, dtype: object

### 1.2 Syntax 2

In [10]:
#select a column with .
df_exams.gender

0      female
1      female
2      female
3        male
4        male
        ...
995    female
996      male
997    female
998    female
999    female
Name: gender, Length: 1000, dtype: object

In [11]:
#pitfalls of selecting a column with .
df_exams.math score #returns an error

SyntaxError: invalid syntax (3980649986.py, line 2)

In [14]:
#selecting the same column using []
df_exams['math score']

0      72
1      69
2      90
3      47
4      76
       ..
995    88
996    62
997    59
998    68
999    77
Name: math score, Length: 1000, dtype: int64